app/views/restaurants/show.html.erb

SELECT "dishes".* FROM "dishes" WHERE "dishes"."restaurant_id" = $1  [["restaurant_id", 1]]
---
    <div id="dishesResults" class="row">
        <% @restaurant.dish.each do |dish| %>

INSERT INTO "dishes" ("name", "price", "restaurant_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Makis Saumon"], ["price", 5.0], ["restaurant_id", 10], ["created_at", "2021-01-29 10:19:49.266334"], ["updated_at", "2021-01-29 10:19:49.266334"]]
---
    </div>
    <% if policy(@restaurant.dish).create? %>