app/controllers/dishes_controller.rb

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
INSERT INTO "dishes" ("name", "price", "restaurant_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Burger2"], ["price", 6.0], ["restaurant_id", 4], ["created_at", "2021-01-22 17:30:37.767354"], ["updated_at", "2021-01-22 17:30:37.767354"]]
---
    def create
        @restaurant = Restaurant.find(params[:restaurant_id])
        authorize @restaurant
        @dish = @restaurant.dish.create(dish_params)

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "dishes".* FROM "dishes" WHERE "dishes"."restaurant_id" = $1 AND "dishes"."id" = $2 LIMIT $3  [["restaurant_id", 4], ["id", 9], ["LIMIT", 1]]
DELETE FROM "dishes" WHERE "dishes"."id" = $1  [["id", 9]]
---
    def destroy
        @restaurant = Restaurant.find(params[:restaurant_id])
        authorize @restaurant
        @dish = @restaurant.dish.find(params[:id])
        @dish.destroy