app/controllers/restaurants_controller.rb

    def create
        @restaurant = Restaurant.new(restaurant_param)

        if @restaurant.save
---
INSERT INTO "restaurants" ("name", "address", "rate", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "KFC"], ["address", "22 rue de la Gare"], ["rate", 3.0], ["user_id", 2], ["created_at", "2021-01-22 16:41:45.232173"], ["updated_at", "2021-01-22 16:41:45.232173"]]

    def update
        if @restaurant.update(restaurant_param)
---
UPDATE "restaurants" SET "address" = $1, "updated_at" = $2 WHERE "restaurants"."id" = $3  [["address", "15 Rue de l'Université, 75019 Paris"], ["updated_at", "2021-01-22 17:39:16.764721"], ["id", 4]]