app/jobs/dish_job.rb

INSERT INTO "dishes" ("name", "price", "restaurant_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Makis Saumon"], ["price", 5.0], ["restaurant_id", 8], ["created_at", "2021-01-29 10:04:13.693203"], ["updated_at", "2021-01-29 10:04:13.693203"]]
INSERT INTO "dishes" ("name", "price", "restaurant_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Makis Fromage"], ["price", 4.5], ["restaurant_id", 8], ["created_at", "2021-01-29 10:04:13.726202"], ["updated_at", "2021-01-29 10:04:13.726202"]]
INSERT INTO "dishes" ("name", "price", "restaurant_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Makis Avocat"], ["price", 4.5], ["restaurant_id", 8], ["created_at", "2021-01-29 10:04:13.758254"], ["updated_at", "2021-01-29 10:04:13.758254"]]
---
  def perform(restaurant, current_user)
    # Do something later
    @dish1 = restaurant.dish.create(name: "Makis Saumon", price: 5.0)
    @dish1.restaurant = restaurant
    @dish1.restaurant.user = current_user
    @dish1.save

    @dish2 = restaurant.dish.create(name: "Makis Fromage", price: 4.5)
    @dish2.restaurant = restaurant
    @dish2.restaurant.user = current_user
    @dish2.save

    @dish3 = restaurant.dish.create(name: "Makis Avocat", price: 4.5)